pavlenko/pio-lib-STM32/inc/stm32/dev/f4/dma.hpp
#pragma once

#include <stm32/dev/common/dma.hpp>

#include <stm32/dev/clock.hpp>

// Remove struct pointers
#ifdef DMA1
#undef DMA1
#endif

#ifdef DMA2
#undef DMA2
#endif

namespace STM32::DMA
{
    using DMA1 = Driver<DriverRegs<DMA1_BASE>, Clock::DMA1Clock>;
    using DMA1Stream0 = Stream<DMA1, ChannelRegs<DMA1_Stream0_BASE>, 0, DMA1_Stream0_IRQn>;
    using DMA1Stream1 = Stream<DMA1, ChannelRegs<DMA1_Stream1_BASE>, 0, DMA1_Stream1_IRQn>;
    using DMA1Stream2 = Stream<DMA1, ChannelRegs<DMA1_Stream2_BASE>, 0, DMA1_Stream2_IRQn>;
    using DMA1Stream3 = Stream<DMA1, ChannelRegs<DMA1_Stream3_BASE>, 0, DMA1_Stream3_IRQn>;
    using DMA1Stream4 = Stream<DMA1, ChannelRegs<DMA1_Stream4_BASE>, 0, DMA1_Stream4_IRQn>;
    using DMA1Stream5 = Stream<DMA1, ChannelRegs<DMA1_Stream5_BASE>, 0, DMA1_Stream5_IRQn>;
    using DMA1Stream6 = Stream<DMA1, ChannelRegs<DMA1_Stream6_BASE>, 0, DMA1_Stream6_IRQn>;
    using DMA1Stream7 = Stream<DMA1, ChannelRegs<DMA1_Stream7_BASE>, 0, DMA1_Stream7_IRQn>;

#ifdef DMA2_BASE
    using DMA2 = Driver<DriverRegs<DMA2_BASE>, Clock::DMA2Clock>;
    using DMA2Stream0 = Stream<DMA2, ChannelRegs<DMA2_Stream0_BASE>, 0, DMA2_Stream0_IRQn>;
    using DMA2Stream1 = Stream<DMA2, ChannelRegs<DMA2_Stream1_BASE>, 0, DMA2_Stream1_IRQn>;
    using DMA2Stream2 = Stream<DMA2, ChannelRegs<DMA2_Stream2_BASE>, 0, DMA2_Stream2_IRQn>;
    using DMA2Stream3 = Stream<DMA2, ChannelRegs<DMA2_Stream3_BASE>, 0, DMA2_Stream3_IRQn>;
    using DMA2Stream4 = Stream<DMA2, ChannelRegs<DMA2_Stream4_BASE>, 0, DMA2_Stream4_IRQn>;
    using DMA2Stream5 = Stream<DMA2, ChannelRegs<DMA2_Stream5_BASE>, 0, DMA2_Stream5_IRQn>;
    using DMA2Stream6 = Stream<DMA2, ChannelRegs<DMA2_Stream6_BASE>, 0, DMA2_Stream6_IRQn>;
    using DMA2Stream7 = Stream<DMA2, ChannelRegs<DMA2_Stream7_BASE>, 0, DMA2_Stream7_IRQn>;
#endif

#define DMA_STREAM_CHANNEL_DEFINITION(__BUS__, __STREAM__)                                                                                                                                                                                               \
    using DMA##__BUS__##Stream##__STREAM__##Channel0 = StreamChannel<DMA##__BUS__##Stream##__STREAM__, 0>;                                                                                                                                               \
    using DMA##__BUS__##Stream##__STREAM__##Channel1 = StreamChannel<DMA##__BUS__##Stream##__STREAM__, 1>;                                                                                                                                               \
    using DMA##__BUS__##Stream##__STREAM__##Channel2 = StreamChannel<DMA##__BUS__##Stream##__STREAM__, 2>;                                                                                                                                               \
    using DMA##__BUS__##Stream##__STREAM__##Channel3 = StreamChannel<DMA##__BUS__##Stream##__STREAM__, 3>;                                                                                                                                               \
    using DMA##__BUS__##Stream##__STREAM__##Channel4 = StreamChannel<DMA##__BUS__##Stream##__STREAM__, 4>;                                                                                                                                               \
    using DMA##__BUS__##Stream##__STREAM__##Channel5 = StreamChannel<DMA##__BUS__##Stream##__STREAM__, 5>;                                                                                                                                               \
    using DMA##__BUS__##Stream##__STREAM__##Channel6 = StreamChannel<DMA##__BUS__##Stream##__STREAM__, 6>;                                                                                                                                               \
    using DMA##__BUS__##Stream##__STREAM__##Channel7 = StreamChannel<DMA##__BUS__##Stream##__STREAM__, 7>;

    DMA_STREAM_CHANNEL_DEFINITION(1, 0);
    DMA_STREAM_CHANNEL_DEFINITION(1, 1);
    DMA_STREAM_CHANNEL_DEFINITION(1, 2);
    DMA_STREAM_CHANNEL_DEFINITION(1, 3);
    DMA_STREAM_CHANNEL_DEFINITION(1, 4);
    DMA_STREAM_CHANNEL_DEFINITION(1, 5);
    DMA_STREAM_CHANNEL_DEFINITION(1, 6);
    DMA_STREAM_CHANNEL_DEFINITION(1, 7);

#ifdef DMA2_BASE
    DMA_STREAM_CHANNEL_DEFINITION(2, 0);
    DMA_STREAM_CHANNEL_DEFINITION(2, 1);
    DMA_STREAM_CHANNEL_DEFINITION(2, 2);
    DMA_STREAM_CHANNEL_DEFINITION(2, 3);
    DMA_STREAM_CHANNEL_DEFINITION(2, 4);
    DMA_STREAM_CHANNEL_DEFINITION(2, 5);
    DMA_STREAM_CHANNEL_DEFINITION(2, 6);
    DMA_STREAM_CHANNEL_DEFINITION(2, 7);
#endif
}
